[
  {
    "id": 1,
    "active": true,
    "title": "【必ずお読みください】",
    "content": "このアプリはテスト版です。\n予告なくサービスの停止やデータの喪失、バグなどが発生する可能性があります。\nご理解のうえ自己責任にてご利用ください。"
  },
  {
    "id": 2,
    "active": true,
    "title": "今後の改善とフィードバックのお願い",
    "content": "走行距離や燃費計算の精度向上、UI改善など、より便利で信頼できるアプリを目指して開発を続けています。\nご利用中にお気づきの点や、「もっとこうだったら良いな」というご意見・ご要望がありましたら、開発者までお気軽にお知らせいただけると嬉しいです！"
  },
  {
    "id": 3,
    "active": true,
    "title": "新機能: 競技車両向け管理機能 (フェーズ1)",
    "content": "いつも「もとぷっぷー」をご利用いただきありがとうございます！\nこの度、主に競技用車両（レーサーやモトクロッサーなど）を管理するための新機能が追加されました（フェーズ1）。\n\n主な変更点:\n- 車両登録時に「レーサー車両」として区別できるようになりました。\n  - 一度登録した車両タイプ（公道車⇔レーサー車）は後から変更できませんのでご注意ください。\n- レーサー車両は、従来の走行距離ではなく「総稼働時間」での管理が可能です。登録時や編集時に総稼働時間を入力できます。\n- レーサー車両は、給油記録・燃費計算の対象外となります。\n- レーサー車両は、ODOメーターリセット機能の対象外となります。\n- レーサー車両の整備記録については、本フェーズではご利用いただけません。今後のアップデート（フェーズ2）で、稼働時間に基づいた整備記録やセッティング記録機能を追加予定です。\n- ノート機能は、レーサー車両に対しても従来通りご利用いただけます。\n- 新しい実績「初めてのレーサー車両登録」などを追加しました。\n\nこの新機能が、皆様の競技車両の管理に少しでもお役に立てれば幸いです。\n今後も段階的にレーサー/モトクロッサー向け機能を拡充していく予定です。ご期待ください！"
  },
  {
    "id": 4,
    "active": true,
    "title": "新機能: 平均燃費計算の精度向上（異常値の除外機能）",
    "content": "いつも「もとぷっぷー」をご利用いただきありがとうございます。\nこの度、平均燃費をより実態に近づけるための新機能を追加しました。\n\n主な変更点:\n- 給油記録の追加・編集画面に「この記録を平均燃費計算から除外する」というチェックボックスを追加しました。\n- 記録忘れや給油量の入力ミスなどで、実態と大きく異なる燃費が計算されてしまう場合に、このチェックボックスをオンにすることで、その記録を全体の平均燃費の計算から除外できます。\n- これにより、より実態に即した平均燃費を管理できるようになります。\n\n今後も皆様のバイクライフがより豊かになるような機能改善に努めてまいります。引き続き「もとぷっぷー」をよろしくお願いいたします。"
  },
  {
    "id": 5,
    "active": true,
    "title": "新機能/UI改善: 給油記録のトリップ入力機能",
    "content": "いつも「もとぷっぷー」をご利用いただきありがとうございます！\n今回のアップデートで、給油記録の入力がより簡単で直感的になりました。\n\n主な変更点:\n- 給油記録の追加・編集画面で、従来のODOメーター値を直接入力する方法に加えて、前回給油時からの走行距離（トリップメーター）で入力できるようになりました。\n- 入力フォームにある「トリップメーターで入力する」というトグルスイッチをONにするだけで、簡単に入力方法を切り替えられます。\n\nこれにより、給油の都度ご自身でODOメーターの値を計算する手間が省け、よりスピーディで間違いの少ない記録が可能です。\nぜひご活用ください！"
  },
  {
    "id": 6,
    "active": true,
    "title": "機能改善: ダッシュボードの総走行距離表示の改善",
    "content": "いつもご利用ありがとうございます。\nダッシュボードの「総走行距離」の計算方法を改善し、より実態に即した数値を表示するよう変更しました。\n\n■ 変更点\n- **(旧)** 全車両の最新ODOメーター値の合算\n- **(新)** 各車両について「アプリに記録された最初の走行距離」と「最新の走行距離」の差を算出し、それらを合算した**『実際に記録された走行距離の合計』**\n\nこの変更により、もとぷっぷーを使い始めてから実際にどれだけ走ったかが、より直感的で正確に把握できるようになります。"
  }
]